{
  "alpha": 16,
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "google/vit-base-patch16-224-in21k",
  "inference_mode": true,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "module_dropout": 0.0,
  "modules_to_save": [
    "classifier"
  ],
  "peft_type": "LOHA",
  "r": 8,
  "rank_dropout": 0.0,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "value",
    "query"
  ],
  "task_type": "IMAGE_CLASSIFICATION",
  "use_effective_conv2d": false
}