{
  "auto_mapping": null,
  "base_model_name_or_path": "google/vit-base-patch16-224-in21k",
  "fan_in_fan_out": false,
  "feedforward_modules": [
    "output.dense",
    "intermediate.dense"
  ],
  "inference_mode": true,
  "init_ia3_weights": true,
  "modules_to_save": [
    "classifier"
  ],
  "peft_type": "IA3",
  "revision": null,
  "target_modules": [
    "output.dense",
    "query",
    "key",
    "value",
    "intermediate.dense"
  ],
  "task_type": "IMAGE_CLASSIFICATION"
}